data/raw_bench/1400_output.txt
Running 30s test @ http://10.99.59.146:8080/wrk2-api/home-timeline/read
  4 threads and 200 connections

  Thread calibration: mean lat.: 0.562ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.563ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.559ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.560ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.99.59.146:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   555.55us  142.63us   0.86ms   87.68%
    Req/Sec   367.62    196.26     0.90k    72.62%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  540.00us
 75.000%  613.00us
 90.000%  683.00us
 99.000%    0.86ms
 99.900%    1.34ms
 99.990%    5.91ms
 99.999%    7.95ms
100.000%    7.95ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.299     0.000000            1         1.00
       0.438     0.100000         2817         1.11
       0.467     0.200000         5634         1.25
       0.491     0.300000         8367         1.43
       0.515     0.400000        11165         1.67
       0.540     0.500000        14007         2.00
       0.552     0.550000        15327         2.22
       0.566     0.600000        16733         2.50
       0.581     0.650000        18189         2.86
       0.596     0.700000        19531         3.33
       0.613     0.750000        20896         4.00
       0.622     0.775000        21591         4.44
       0.632     0.800000        22307         5.00
       0.643     0.825000        23041         5.71
       0.654     0.850000        23709         6.67
       0.667     0.875000        24383         8.00
       0.674     0.887500        24743         8.89
       0.683     0.900000        25074        10.00
       0.692     0.912500        25415        11.43
       0.703     0.925000        25756        13.33
       0.716     0.937500        26109        16.00
       0.723     0.943750        26279        17.78
       0.731     0.950000        26461        20.00
       0.740     0.956250        26629        22.86
       0.753     0.962500        26806        26.67
       0.764     0.968750        26978        32.00
       0.771     0.971875        27064        35.56
       0.779     0.975000        27144        40.00
       0.787     0.978125        27232        45.71
       0.798     0.981250        27318        53.33
       0.813     0.984375        27407        64.00
       0.823     0.985938        27452        71.11
       0.831     0.987500        27494        80.00
       0.846     0.989062        27537        91.43
       0.865     0.990625        27580       106.67
       0.891     0.992188        27623       128.00
       0.907     0.992969        27645       142.22
       0.920     0.993750        27666       160.00
       0.947     0.994531        27688       182.86
       0.985     0.995313        27711       213.33
       1.032     0.996094        27732       256.00
       1.044     0.996484        27743       284.44
       1.071     0.996875        27753       320.00
       1.098     0.997266        27764       365.71
       1.126     0.997656        27775       426.67
       1.172     0.998047        27786       512.00
       1.223     0.998242        27792       568.89
       1.256     0.998437        27797       640.00
       1.272     0.998633        27802       731.43
       1.292     0.998828        27808       853.33
       1.340     0.999023        27813      1024.00
       1.380     0.999121        27816      1137.78
       1.454     0.999219        27819      1280.00
       1.667     0.999316        27821      1462.86
       1.904     0.999414        27824      1706.67
       2.055     0.999512        27827      2048.00
       2.317     0.999561        27828      2275.56
       3.145     0.999609        27830      2560.00
       3.209     0.999658        27831      2925.71
       3.341     0.999707        27832      3413.33
       4.715     0.999756        27834      4096.00
       4.715     0.999780        27834      4551.11
       4.875     0.999805        27835      5120.00
       5.699     0.999829        27836      5851.43
       5.699     0.999854        27836      6826.67
       5.915     0.999878        27838      8192.00
       5.915     0.999890        27838      9102.22
       5.915     0.999902        27838     10240.00
       5.915     0.999915        27838     11702.86
       5.915     0.999927        27838     13653.33
       6.907     0.999939        27839     16384.00
       6.907     0.999945        27839     18204.44
       6.907     0.999951        27839     20480.00
       6.907     0.999957        27839     23405.71
       6.907     0.999963        27839     27306.67
       7.955     0.999969        27840     32768.00
       7.955     1.000000        27840          inf
#[Mean    =        0.556, StdDeviation   =        0.143]
#[Max     =        7.952, Total count    =        27840]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  41792 requests in 30.00s, 7.93MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
Requests/sec:   1393.00  
Transfer/sec:    270.71KB