data/raw_bench/1500_output.txt
Running 30s test @ http://10.99.59.146:8080/wrk2-api/home-timeline/read
  4 threads and 200 connections

  Thread calibration: mean lat.: 0.556ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.552ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.549ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.565ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.99.59.146:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   552.71us  226.95us 847.00us   97.79%
    Req/Sec   393.18    205.75     0.90k    70.52%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  534.00us
 75.000%  605.00us
 90.000%  673.00us
 99.000%  847.00us
 99.900%    1.66ms
 99.990%   10.75ms
 99.999%   12.30ms
100.000%   12.30ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.294     0.000000            1         1.00
       0.435     0.100000         3030         1.11
       0.463     0.200000         5958         1.25
       0.487     0.300000         9045         1.43
       0.510     0.400000        11998         1.67
       0.534     0.500000        14922         2.00
       0.547     0.550000        16463         2.22
       0.560     0.600000        17933         2.50
       0.574     0.650000        19465         2.86
       0.588     0.700000        20838         3.33
       0.605     0.750000        22338         4.00
       0.614     0.775000        23098         4.44
       0.623     0.800000        23834         5.00
       0.633     0.825000        24583         5.71
       0.644     0.850000        25309         6.67
       0.657     0.875000        26055         8.00
       0.664     0.887500        26419         8.89
       0.673     0.900000        26817        10.00
       0.682     0.912500        27168        11.43
       0.692     0.925000        27529        13.33
       0.705     0.937500        27920        16.00
       0.712     0.943750        28096        17.78
       0.720     0.950000        28275        20.00
       0.729     0.956250        28461        22.86
       0.740     0.962500        28658        26.67
       0.752     0.968750        28830        32.00
       0.761     0.971875        28930        35.56
       0.769     0.975000        29019        40.00
       0.779     0.978125        29110        45.71
       0.792     0.981250        29202        53.33
       0.805     0.984375        29295        64.00
       0.813     0.985938        29345        71.11
       0.824     0.987500        29387        80.00
       0.841     0.989062        29435        91.43
       0.855     0.990625        29482       106.67
       0.886     0.992188        29526       128.00
       0.901     0.992969        29549       142.22
       0.921     0.993750        29576       160.00
       0.941     0.994531        29596       182.86
       0.990     0.995313        29619       213.33
       1.026     0.996094        29642       256.00
       1.045     0.996484        29654       284.44
       1.079     0.996875        29666       320.00
       1.129     0.997266        29677       365.71
       1.169     0.997656        29689       426.67
       1.192     0.998047        29700       512.00
       1.224     0.998242        29706       568.89
       1.276     0.998437        29712       640.00
       1.384     0.998633        29718       731.43
       1.550     0.998828        29724       853.33
       1.722     0.999023        29729      1024.00
       2.047     0.999121        29732      1137.78
       3.141     0.999219        29735      1280.00
       3.887     0.999316        29738      1462.86
       4.983     0.999414        29741      1706.67
       6.003     0.999512        29744      2048.00
       6.083     0.999561        29745      2275.56
       7.323     0.999609        29747      2560.00
       7.519     0.999658        29748      2925.71
       8.107     0.999707        29750      3413.33
       8.295     0.999756        29751      4096.00
       8.511     0.999780        29752      4551.11
       8.527     0.999805        29753      5120.00
       8.527     0.999829        29753      5851.43
       9.887     0.999854        29754      6826.67
      10.751     0.999878        29755      8192.00
      10.751     0.999890        29755      9102.22
      11.231     0.999902        29756     10240.00
      11.231     0.999915        29756     11702.86
      11.231     0.999927        29756     13653.33
      11.791     0.999939        29757     16384.00
      11.791     0.999945        29757     18204.44
      11.791     0.999951        29757     20480.00
      11.791     0.999957        29757     23405.71
      11.791     0.999963        29757     27306.67
      12.303     0.999969        29758     32768.00
      12.303     1.000000        29758          inf
#[Mean    =        0.553, StdDeviation   =        0.227]
#[Max     =       12.296, Total count    =        29758]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  44722 requests in 30.01s, 8.49MB read
  Socket errors: connect 0, read 0, write 0, timeout 2
Requests/sec:   1490.34  
Transfer/sec:    289.63KB